vvdung-husc/2025-2026.2.TIN4024.001/TEAM_04/LeVanThuan/ESP8266_BLYNK_TELEGRAM/src/main.cpp
// ===================== 🔧 HELPER FUNCTIONS =====================
String formatUptime(unsigned long ms) {
  unsigned long totalSec = ms / 1000;
  unsigned long days = totalSec / 86400;
  unsigned long hours = (totalSec % 86400) / 3600;
  unsigned long mins = (totalSec % 3600) / 60;
  unsigned long secs = totalSec % 60;
  char buf[32];
  snprintf(buf, sizeof(buf), "%luD %02lu:%02lu:%02lu", days, hours, mins, secs);
  return String(buf);
}

void setRelay(bool state) {
  relayState = state;
  digitalWrite(RELAY_PIN, state ? LOW : HIGH); // LOW = BẬT, HIGH = TẮT
  if (Blynk.connected()) {
    Blynk.virtualWrite(V0, state ? 1 : 0);
  }
}

void sendTelegramMessage(const String& text) {
  if (WiFi.status() == WL_CONNECTED) {
    bot.sendMessage(CHAT_ID, text, "Markdown");
  }
}

// ===================== 📊 FORMATTED MESSAGES =====================
String getFormattedSensorData() {
  String msg = "📊 *BÁO CÁO CẢM BIẾN*\n";
  msg += "━━━━━━━━━━━━━━\n";
  msg += "🌡️ Nhiệt độ: `" + String(temperature, 1) + " °C`\n";
  msg += "💧 Độ ẩm:   `" + String(humidity, 1) + " %`\n";
  msg += "☁️ Khí gas:  `" + String(gasValue) + "`\n";
  msg += "💡 Đèn:      `" + String(relayState ? "BẬT ✅" : "TẮT ❌") + "`\n";
  msg += "⏱️ Uptime:   `" + formatUptime(millis()) + "`\n";
  msg += "━━━━━━━━━━━━━━\n";
  msg += "👥 " + String(TEAM_NAME);
  return msg;
}

void sendCommandHelp(const String& chat_id) {
  String help = "🤖 *ESP8266 Control Bot*\n";
  help += "━━━━━━━━━━━━━━━━━━\n";
  help += "🔧 *Lệnh điều khiển:*\n";
  help += "  /led_on 🔵 - Bật đèn\n";
  help += "  /led_off 🔴 - Tắt đèn\n";
  help += "  /led_status 💡 - Xem trạng thái đèn\n";
  help += "\n";
  help += "📊 *Lệnh cảm biến:*\n";
  help += "  /get_weather 🌡️ - Nhiệt độ & độ ẩm\n";
  help += "  /get_gas ☁️ - Giá trị khí gas\n";
  help += "  /get_all 📋 - Xem tất cả dữ liệu\n";
  help += "\n";
  help += "⚙️ *Hệ thống:*\n";
  help += "  /start 🏠 - Menu chính\n";
  help += "  /uptime ⏱️ - Thời gian hoạt động\n";
  help += "━━━━━━━━━━━━━━━━━━\n";
  help += "👥 " + String(TEAM_NAME);
  bot.sendMessage(chat_id, help, "Markdown");
}

// ===================== 🌤️ NOTIFICATIONS =====================
void notifyWeatherChange() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (millis() - lastWeatherNotify < 300000) return; // 5 phút cooldown

  bool tempChanged = fabs(temperature - lastSentTemp) >= 0.5f;
  bool humChanged  = fabs(humidity - lastSentHum) >= 1.0f;

  if (tempChanged || humChanged) {
    String alert = "🌤️ *THAY ĐỔI MÔI TRƯỜNG*\n";
    alert += "━━━━━━━━━━━━━━\n";
    
    if (tempChanged) {
      if (temperature > 30) alert += "🔥 Nóng: ";
      else if (temperature < 18) alert += "❄️ Lạnh: ";
      else alert += "🌡️ Nhiệt độ: ";
      alert += "`" + String(temperature, 1) + " °C`\n";
    }
    if (humChanged) {
      if (humidity > 80) alert += "🌧️ Ẩm cao: ";
      else if (humidity < 40) alert += "🏜️ Khô: ";
      else alert += "💧 Độ ẩm: ";
      alert += "`" + String(humidity, 1) + " %`\n";
    }
    alert += "━━━━━━━━━━━━━━\n";
    alert += "👥 " + String(TEAM_NAME);
    
    sendTelegramMessage(alert);
    lastSentTemp = temperature;
    lastSentHum = humidity;
    lastWeatherNotify = millis();
  }
}

void notifyGasLevel() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (millis() - lastGasNotify < 300000) return; // 5 phút cooldown
  if (lastSentGas < 0 || abs(gasValue - lastSentGas) >= 50) {
    
    String alert;
    if (gasValue > 700) {
      alert = "🚨 *CẢNH BÁO KHÍ GAS CAO!* 🚨\n";
      alert += "━━━━━━━━━━━━━━\n";
      alert += "☁️ Giá trị: `" + String(gasValue) + "`\n";
      alert += "⚠️ Vui lòng kiểm tra ngay!\n";
    } else if (gasValue > 400) {
      alert = "⚡ *Khí gas tăng*\n";
      alert += "━━━━━━━━━━━━━━\n";
      alert += "☁️ Giá trị: `" + String(gasValue) + "`\n";
      alert += "👀 Đang theo dõi...\n";
    } else {
      alert = "☁️ *Cập nhật khí gas*\n";
      alert += "━━━━━━━━━━━━━━\n";
      alert += "📊 Giá trị: `" + String(gasValue) + "`\n";
      alert += "✅ Mức bình thường\n";
    }
    alert += "━━━━━━━━━━━━━━\n";
    alert += "👥 " + String(TEAM_NAME);
    
    sendTelegramMessage(alert);
    lastSentGas = gasValue;
    lastGasNotify = millis();
  }
}

// ===================== 📡 SENSOR READ =====================
void readSensors() {
  static unsigned long lastRead = 0;
  if (millis() - lastRead < 2200) return; // DHT22 minimum interval
  lastRead = millis();

  float t = dht.readTemperature();
  float h = dht.readHumidity();
  if (!isnan(t)) temperature = t;
  else Serial.println("❌ Loi doc nhiet do DHT!");
  
  if (!isnan(h)) humidity = h;
  else Serial.println("❌ Loi doc do am DHT!");

  gasValue = useRandomGas ? random(200, 900) : analogRead(MQ2_PIN);
}

void printSerialData() {
  Serial.println("=================================");
  Serial.printf("⏱️ Uptime    : %s\n", formatUptime(millis()).c_str());
  Serial.printf("🌡️ Nhiet do  : %.1f C\n", temperature);
  Serial.printf("💧 Do am     : %.1f %%\n", humidity);
  Serial.printf("☁️ Khi gas   : %d\n", gasValue);
  Serial.printf("💡 Relay     : %s\n", relayState ? "BAT" : "TAT");
}

// ===================== 🖥️ OLED DISPLAY =====================
void updateOLED() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  display.setCursor(0, 0);
  display.println("📡 ESP8266 IoT");

  display.setCursor(0, 12);
  display.printf("🌡️ %.1fC  💧%.1f%%", temperature, humidity);

  display.setCursor(0, 24);
  display.printf("☁️ Gas: %d", gasValue);

  display.setCursor(0, 36);
  display.printf("💡 Den: %s", relayState ? "BAT [V]" : "TAT [ ]");

  // Thanh progress cho gas
  display.drawRect(0, 48, map(constrain(gasValue, 0, 1023), 0, 1023, 0, 127), 4, SH110X_WHITE);

  display.setCursor(75, 56);
  display.print(TEAM_NAME);
  display.display();
}

// ===================== 🌐 BLYNK CALLBACKS =====================
BLYNK_CONNECTED() {
  Blynk.syncVirtual(V0);
}

BLYNK_WRITE(V0) {
  int value = param.asInt();
  setRelay(value == 1);
}

void updateBlynk() {
  if (!Blynk.connected()) return;
  Blynk.virtualWrite(V1, temperature);
  Blynk.virtualWrite(V2, humidity);
  Blynk.virtualWrite(V3, gasValue);
  Blynk.virtualWrite(V4, formatUptime(millis()));
  Blynk.virtualWrite(V5, TEAM_NAME);
}

// ===================== 🤖 TELEGRAM HANDLER =====================
void handleNewMessages(int numNewMessages) {
  for (int i = 0; i < numNewMessages; i++) {
    String chat_id = bot.messages[i].chat_id;
    String text = bot.messages[i].text;
    String from_name = bot.messages[i].from_name;

    Serial.println("📨 Telegram: " + text);

    // 🔐 Security check
    if (chat_id != CHAT_ID) {
      bot.sendMessage(chat_id, "❌ *Truy cập bị từ chối!*\nBot chỉ dành cho admin.", "Markdown");
      continue;
    }

