vvdung-husc/2025-2026.2.TIN4024.001/TEAM_04/LeVanThuan/ESP8266_BLYNK_TELEGRAM/src/main.cpp
    // 🎮 Command handling
    if (text == "/start") {
      sendCommandHelp(chat_id);
    }
    else if (text == "/led_on") {
      setRelay(true);
      bot.sendMessage(chat_id, "💡 *Đèn đã BẬT*\n👥 " + String(TEAM_NAME), "Markdown");
    }
    else if (text == "/led_off") {
      setRelay(false);
      bot.sendMessage(chat_id, "🔴 *Đèn đã TẮT*\n👥 " + String(TEAM_NAME), "Markdown");
    }
    else if (text == "/led_status") {
      String status = relayState ? "🟢 *Đang BẬT*" : "🔴 *Đang TẮT*";
      bot.sendMessage(chat_id, status + "\n👥 " + String(TEAM_NAME), "Markdown");
    }
    else if (text == "/get_weather") {
      String weather = "🌤️ *THỜI TIẾT HIỆN TẠI*\n";
      weather += "━━━━━━━━━━━━━━\n";
      weather += "🌡️ `" + String(temperature, 1) + " °C`\n";
      weather += "💧 `" + String(humidity, 1) + " %`\n";
      weather += "━━━━━━━━━━━━━━\n";
      weather += "👥 " + String(TEAM_NAME);
      bot.sendMessage(chat_id, weather, "Markdown");
    }
    else if (text == "/get_gas") {
      String gasMsg = "☁️ *KHÍ GAS*\n";
      gasMsg += "━━━━━━━━━━━━━━\n";
      gasMsg += "📊 `" + String(gasValue) + "`\n";
      if (gasValue > 700) gasMsg += "🚨 *MỨC CAO!*";
      else if (gasValue > 400) gasMsg += "⚠️ *MỨC TRUNG BÌNH*";
      else gasMsg += "✅ *MỨC BÌNH THƯỜNG*";
      gasMsg += "\n━━━━━━━━━━━━━━\n👥 " + String(TEAM_NAME);
      bot.sendMessage(chat_id, gasMsg, "Markdown");
    }
    else if (text == "/get_all") {
      bot.sendMessage(chat_id, getFormattedSensorData(), "Markdown");
    }
    else if (text == "/uptime") {
      String uptime = "⏱️ *THỜI GIAN HOẠT ĐỘNG*\n";
      uptime += "━━━━━━━━━━━━━━\n";
      uptime += "`" + formatUptime(millis()) + "`\n";
      uptime += "━━━━━━━━━━━━━━\n";
      uptime += "👥 " + String(TEAM_NAME);
      bot.sendMessage(chat_id, uptime, "Markdown");
    }
    else {
      bot.sendMessage(chat_id, "❓ *Lệnh không hợp lệ!*\nGõ /start để xem danh sách lệnh.", "Markdown");
    }
  }
}

void checkTelegram() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (millis() - lastTelegramCheck < 2000) return;
  lastTelegramCheck = millis();

  Serial.println("🔍 Telegram: dang kiem tra...");
  int numNewMessages = bot.getUpdates(bot.last_message_received + 1);
  
  while (numNewMessages) {
    handleNewMessages(numNewMessages);
    numNewMessages = bot.getUpdates(bot.last_message_received + 1);
  }
}

// ===================== 🔄 TASKS =====================
void taskReadData() {
  readSensors();
  printSerialData();
  updateOLED();
}

void taskCloudUpdate() {
  updateBlynk();
}

void taskTelegramNotify() {
  notifyWeatherChange();
  notifyGasLevel();
}

void connectWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, pass);
  Serial.print("📡 Dang ket noi WiFi");
  unsigned long startAttemptTime = millis();

  while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < 20000) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("✅ WiFi OK. IP: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("❌ Khong ket noi duoc WiFi.");
  }
}

void reconnectIfNeeded() {
  if (WiFi.status() != WL_CONNECTED) connectWiFi();
  if (WiFi.status() == WL_CONNECTED && !Blynk.connected()) {
    Serial.println("🔄 Dang ket noi lai Blynk...");
    Blynk.connect(5000);
  }
}

// ===================== 🚀 SETUP =====================
void setup() {
  Serial.begin(115200);
  delay(200);

  pinMode(RELAY_PIN, OUTPUT);
  digitalWrite(RELAY_PIN, HIGH); // Khởi động: đèn TẮT

  dht.begin();
  Wire.begin(OLED_SDA, OLED_SCL);
  
  if (!display.begin(0x3C, true)) {
    Serial.println("❌ Khong tim thay OLED SH1106!");
    while (true) delay(1000);
  }

  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);
  display.setCursor(0, 0);
  display.println("✨ Dang khoi dong...");
  display.display();

  randomSeed(analogRead(A0));
  connectWiFi();

  Blynk.config(BLYNK_AUTH_TOKEN);
  if (WiFi.status() == WL_CONNECTED) Blynk.connect(10000);

  secured_client.setInsecure();
  setRelay(false);
  
  readSensors();
  updateOLED();
  updateBlynk();

  timer.setInterval(2500L, taskReadData);      // ✅ 2.5s cho DHT22
  timer.setInterval(3000L, taskCloudUpdate);
  timer.setInterval(5000L, taskTelegramNotify);

  Serial.println("✨ He thong san sang.");
  
  // 🎉 Startup message
  if (WiFi.status() == WL_CONNECTED) {
    String msg = "✨ *ESP8266 ĐÃ KHỞI ĐỘNG!* ✨\n";
    msg += "━━━━━━━━━━━━━━\n";
    msg += "📡 IP: `" + WiFi.localIP().toString() + "`\n";
    msg += "📶 WiFi: `" + String(ssid) + "`\n";
    msg += "🌡️ Temp: `" + String(temperature, 1) + " °C`\n";
    msg += "💡 Relay: `" + String(relayState ? "BẬT" : "TẮT") + "`\n";
    msg += "━━━━━━━━━━━━━━\n";
    msg += "🤖 Sẵn sàng nhận lệnh!\n";
    msg += "👥 " + String(TEAM_NAME);
    sendTelegramMessage(msg);
  }
}

// ===================== 🔄 LOOP =====================
void loop() {
  reconnectIfNeeded();
  Blynk.run();
  timer.run();
  checkTelegram();
}










////////////////////////////////////////////////
/*
THONG TIN NHOM 04
1. Le Van Thuan
2. Nguyen Cong Thanh
3. ...
4. ...
5. ...
*/

// #define BLYNK_TEMPLATE_ID   "TMPL6scT0Job2"
// #define BLYNK_TEMPLATE_NAME "ESP8266 BLYNK TELEGRAM"
// #define BLYNK_AUTH_TOKEN    "RC4iydZWVV92FAZFII_Zf_MDGsbC5pSb"

// #define BLYNK_PRINT Serial

// #include <Arduino.h>
// #include <math.h>
// #include <ESP8266WiFi.h>
// #include <WiFiClientSecure.h>
// #include <BlynkSimpleEsp8266.h>
// #include <UniversalTelegramBot.h>
// #include <ArduinoJson.h>
// #include <DHT.h>
// #include <Wire.h>
// #include <Adafruit_GFX.h>
// #include <Adafruit_SH110X.h>

// // ===================== WIFI =====================
// char ssid[] = "abc";
// char pass[] = "12345678";

// // ===================== TELEGRAM =====================
// #define BOT_TOKEN "8513235724:AAGfkRD5BLb7zPl6uA6lPWX5Bzevu-o2fSo"
// #define CHAT_ID   "-5275641584"

// // ===================== PIN CONFIG =====================
// #define DHTPIN      D3
// #define DHTTYPE     DHT22
// #define RELAY_PIN   2
// #define MQ2_PIN     A0
// #define OLED_SDA    D2
// #define OLED_SCL    D1

// // ===================== TEAM INFO =====================
// const char* TEAM_NAME = "Team 04";

// // ===================== GAS THRESHOLD =====================
// const int GAS_MEDIUM_THRESHOLD = 400;
// const int GAS_HIGH_THRESHOLD   = 700;

// // ===================== OBJECTS =====================
// DHT dht(DHTPIN, DHTTYPE);
// Adafruit_SH1106G display(128, 64, &Wire, -1);
// BlynkTimer timer;
// WiFiClientSecure secured_client;
// UniversalTelegramBot bot(BOT_TOKEN, secured_client);

// // ===================== GLOBAL VARIABLES =====================
// float temperature = 0.0f;
// float humidity = 0.0f;
// int gasValue = 0;
// bool relayState = false;

