vvdung-husc/2025-2026.2.TIN4024.001/TEAM_04/LeVanThuan/ESP8266_BLYNK_TELEGRAM/src/main.cpp
// unsigned long lastTelegramCheck = 0;
// float lastSentTemp = -999.0f;
// float lastSentHum = -999.0f;
// int lastSentGas = -1;
// bool useRandomGas = false;

// // Rate limit notifications
// unsigned long lastGasNotify = 0;
// unsigned long lastWeatherNotify = 0;

// // ===================== HELPER FUNCTIONS =====================
// String formatUptime(unsigned long ms) {
//   unsigned long totalSec = ms / 1000;
//   unsigned long days = totalSec / 86400;
//   unsigned long hours = (totalSec % 86400) / 3600;
//   unsigned long mins = (totalSec % 3600) / 60;
//   unsigned long secs = totalSec % 60;

//   char buf[32];
//   snprintf(buf, sizeof(buf), "%luD %02lu:%02lu:%02lu", days, hours, mins, secs);
//   return String(buf);
// }

// String formatUptimeShort(unsigned long ms) {
//   unsigned long totalSec = ms / 1000;
//   unsigned long hours = (totalSec % 86400) / 3600;
//   unsigned long mins = (totalSec % 3600) / 60;
//   unsigned long secs = totalSec % 60;

//   char buf[16];
//   snprintf(buf, sizeof(buf), "%02lu:%02lu:%02lu", hours, mins, secs);
//   return String(buf);
// }

// void setRelay(bool state) {
//   relayState = state;

//   // LOW = BAT, HIGH = TAT
//   digitalWrite(RELAY_PIN, state ? LOW : HIGH);

//   if (Blynk.connected()) {
//     Blynk.virtualWrite(V0, state ? 1 : 0);
//   }
// }

// void sendTelegramMessage(const String& text) {
//   if (WiFi.status() == WL_CONNECTED) {
//     bot.sendMessage(CHAT_ID, text, "Markdown");
//   }
// }

// // ===================== FORMATTED MESSAGES =====================
// String getFormattedSensorData() {
//   String msg = "📊 *BAO CAO CAM BIEN*\n";
//   msg += "━━━━━━━━━━━━━━\n";
//   msg += "🌡️ Nhiet do: `" + String(temperature, 1) + " C`\n";
//   msg += "💧 Do am: `" + String(humidity, 1) + " %`\n";
//   msg += "☁️ Khi gas: `" + String(gasValue) + "`\n";
//   msg += "💡 Den: `" + String(relayState ? "BAT" : "TAT") + "`\n";
//   msg += "⏱️ Uptime: `" + formatUptime(millis()) + "`\n";
//   msg += "━━━━━━━━━━━━━━\n";
//   msg += "👥 " + String(TEAM_NAME);
//   return msg;
// }

// void sendCommandHelp(const String& chat_id) {
//   String help = "🤖 *ESP8266 Control Bot*\n";
//   help += "━━━━━━━━━━━━━━━━━━\n";
//   help += "🔧 *Lenh dieu khien:*\n";
//   help += "  /led_on - Bat den\n";
//   help += "  /led_off - Tat den\n";
//   help += "  /led_status - Xem trang thai den\n";
//   help += "\n";
//   help += "📊 *Lenh cam bien:*\n";
//   help += "  /get_weather - Nhiet do & do am\n";
//   help += "  /get_gas - Gia tri khi gas\n";
//   help += "  /get_all - Xem tat ca du lieu\n";
//   help += "\n";
//   help += "⚙️ *He thong:*\n";
//   help += "  /start - Menu chinh\n";
//   help += "  /uptime - Thoi gian hoat dong\n";
//   help += "━━━━━━━━━━━━━━━━━━\n";
//   help += "👥 " + String(TEAM_NAME);

//   bot.sendMessage(chat_id, help, "Markdown");
// }

// // ===================== NOTIFICATIONS =====================
// void notifyWeatherChange() {
//   if (WiFi.status() != WL_CONNECTED) return;
//   if (millis() - lastWeatherNotify < 300000) return;

//   bool tempChanged = fabs(temperature - lastSentTemp) >= 0.5f;
//   bool humChanged  = fabs(humidity - lastSentHum) >= 1.0f;

//   if (tempChanged || humChanged) {
//     String alert = "🌤️ *THAY DOI MOI TRUONG*\n";
//     alert += "━━━━━━━━━━━━━━\n";

//     if (tempChanged) {
//       if (temperature > 30) alert += "🔥 Nong: ";
//       else if (temperature < 18) alert += "❄️ Lanh: ";
//       else alert += "🌡️ Nhiet do: ";
//       alert += "`" + String(temperature, 1) + " C`\n";
//     }

//     if (humChanged) {
//       if (humidity > 80) alert += "🌧️ Am cao: ";
//       else if (humidity < 40) alert += "🏜️ Kho: ";
//       else alert += "💧 Do am: ";
//       alert += "`" + String(humidity, 1) + " %`\n";
//     }

//     alert += "━━━━━━━━━━━━━━\n";
//     alert += "👥 " + String(TEAM_NAME);

//     sendTelegramMessage(alert);
//     lastSentTemp = temperature;
//     lastSentHum = humidity;
//     lastWeatherNotify = millis();
//   }
// }

// void notifyGasLevel() {
//   if (WiFi.status() != WL_CONNECTED) return;
//   if (millis() - lastGasNotify < 300000) return;

//   if (lastSentGas < 0 || abs(gasValue - lastSentGas) >= 50) {
//     String alert;

//     if (gasValue > GAS_HIGH_THRESHOLD) {
//       alert = "🚨 *CANH BAO KHI GAS CAO!* 🚨\n";
//       alert += "━━━━━━━━━━━━━━\n";
//       alert += "☁️ Gia tri: `" + String(gasValue) + "`\n";
//       alert += "⚠️ Vui long kiem tra ngay!\n";
//     }
//     else if (gasValue > GAS_MEDIUM_THRESHOLD) {
//       alert = "⚡ *Khi gas tang*\n";
//       alert += "━━━━━━━━━━━━━━\n";
//       alert += "☁️ Gia tri: `" + String(gasValue) + "`\n";
//       alert += "👀 Dang theo doi...\n";
//     }
//     else {
//       alert = "☁️ *Cap nhat khi gas*\n";
//       alert += "━━━━━━━━━━━━━━\n";
//       alert += "📊 Gia tri: `" + String(gasValue) + "`\n";
//       alert += "✅ Muc binh thuong\n";
//     }

//     alert += "━━━━━━━━━━━━━━\n";
//     alert += "👥 " + String(TEAM_NAME);

//     sendTelegramMessage(alert);
//     lastSentGas = gasValue;
//     lastGasNotify = millis();
//   }
// }

// // ===================== SENSOR READ =====================
// int readGasAverage() {
//   long sum = 0;
//   for (int i = 0; i < 10; i++) {
//     sum += analogRead(MQ2_PIN);
//     delay(5);
//   }
//   return sum / 10;
// }

// void readSensors() {
//   static unsigned long lastRead = 0;
//   if (millis() - lastRead < 2200) return;
//   lastRead = millis();

//   float t = dht.readTemperature();
//   float h = dht.readHumidity();

//   if (!isnan(t)) temperature = t;
//   else Serial.println("Loi doc nhiet do DHT!");

//   if (!isnan(h)) humidity = h;
//   else Serial.println("Loi doc do am DHT!");

//   gasValue = useRandomGas ? random(200, 900) : readGasAverage();
// }

// void printSerialData() {
//   Serial.println("=================================");
//   Serial.printf("Uptime    : %s\n", formatUptime(millis()).c_str());
//   Serial.printf("Nhiet do  : %.1f C\n", temperature);
//   Serial.printf("Do am     : %.1f %%\n", humidity);
//   Serial.printf("Khi gas   : %d\n", gasValue);
//   Serial.printf("Relay     : %s\n", relayState ? "BAT" : "TAT");
// }

// // ===================== OLED DISPLAY =====================
// void updateOLED() {
//   display.clearDisplay();
//   display.setTextSize(1);
//   display.setTextColor(SH110X_WHITE);

