vvdung-husc/2025-2026.2.TIN4024.001/TEAM_04/LeVanThuan/ESP8266_BLYNK_TELEGRAM/src/main.cpp
//   display.setCursor(0, 0);
//   display.println("ESP8266 IoT");

//   display.setCursor(0, 10);
//   display.printf("Temp: %.1f C", temperature);

//   display.setCursor(0, 20);
//   display.printf("Hum : %.1f %%", humidity);

//   display.setCursor(0, 30);
//   display.printf("Gas : %d", gasValue);

//   display.setCursor(0, 40);
//   display.printf("Lamp: %s", relayState ? "ON" : "OFF");

//   display.setCursor(0, 50);
//   display.print("Up  : ");
//   display.print(formatUptimeShort(millis()));

//   display.setCursor(88, 50);
//   display.print("T04");

//   display.display();
// }

// // ===================== BLYNK CALLBACKS =====================
// BLYNK_CONNECTED() {
//   Blynk.syncVirtual(V0);
// }

// BLYNK_WRITE(V0) {
//   int value = param.asInt();
//   setRelay(value == 1);
// }

// void updateBlynk() {
//   if (!Blynk.connected()) return;

//   Blynk.virtualWrite(V0, relayState ? 1 : 0);
//   Blynk.virtualWrite(V1, temperature);
//   Blynk.virtualWrite(V2, humidity);
//   Blynk.virtualWrite(V3, gasValue);
//   Blynk.virtualWrite(V4, formatUptime(millis()));
//   Blynk.virtualWrite(V5, TEAM_NAME);
// }

// // ===================== TELEGRAM HANDLER =====================
// void handleNewMessages(int numNewMessages) {
//   for (int i = 0; i < numNewMessages; i++) {
//     String chat_id = bot.messages[i].chat_id;
//     String text = bot.messages[i].text;
//     String from_name = bot.messages[i].from_name;

//     Serial.println("Telegram: " + text);

//     if (chat_id != CHAT_ID) {
//       bot.sendMessage(chat_id, "❌ *Truy cap bi tu choi!*\nBot chi danh cho admin.", "Markdown");
//       continue;
//     }

//     if (text == "/start") {
//       String welcome = "Xin chao " + from_name + "\n";
//       bot.sendMessage(chat_id, welcome, "");
//       sendCommandHelp(chat_id);
//     }
//     else if (text == "/led_on") {
//       setRelay(true);
//       bot.sendMessage(chat_id, "💡 *Den da BAT*\n👥 " + String(TEAM_NAME), "Markdown");
//     }
//     else if (text == "/led_off") {
//       setRelay(false);
//       bot.sendMessage(chat_id, "🔴 *Den da TAT*\n👥 " + String(TEAM_NAME), "Markdown");
//     }
//     else if (text == "/led_status") {
//       String status = relayState ? "🟢 *Dang BAT*" : "🔴 *Dang TAT*";
//       bot.sendMessage(chat_id, status + "\n👥 " + String(TEAM_NAME), "Markdown");
//     }
//     else if (text == "/get_weather") {
//       String weather = "🌤️ *THOI TIET HIEN TAI*\n";
//       weather += "━━━━━━━━━━━━━━\n";
//       weather += "🌡️ `" + String(temperature, 1) + " C`\n";
//       weather += "💧 `" + String(humidity, 1) + " %`\n";
//       weather += "━━━━━━━━━━━━━━\n";
//       weather += "👥 " + String(TEAM_NAME);
//       bot.sendMessage(chat_id, weather, "Markdown");
//     }
//     else if (text == "/get_gas") {
//       String gasMsg = "☁️ *KHI GAS*\n";
//       gasMsg += "━━━━━━━━━━━━━━\n";
//       gasMsg += "📊 `" + String(gasValue) + "`\n";

//       if (gasValue > GAS_HIGH_THRESHOLD) gasMsg += "🚨 *MUC CAO!*";
//       else if (gasValue > GAS_MEDIUM_THRESHOLD) gasMsg += "⚠️ *MUC TRUNG BINH*";
//       else gasMsg += "✅ *MUC BINH THUONG*";

//       gasMsg += "\n━━━━━━━━━━━━━━\n👥 " + String(TEAM_NAME);
//       bot.sendMessage(chat_id, gasMsg, "Markdown");
//     }
//     else if (text == "/get_all") {
//       bot.sendMessage(chat_id, getFormattedSensorData(), "Markdown");
//     }
//     else if (text == "/uptime") {
//       String uptime = "⏱️ *THOI GIAN HOAT DONG*\n";
//       uptime += "━━━━━━━━━━━━━━\n";
//       uptime += "`" + formatUptime(millis()) + "`\n";
//       uptime += "━━━━━━━━━━━━━━\n";
//       uptime += "👥 " + String(TEAM_NAME);
//       bot.sendMessage(chat_id, uptime, "Markdown");
//     }
//     else {
//       bot.sendMessage(chat_id, "❓ *Lenh khong hop le!*\nGo /start de xem danh sach lenh.", "Markdown");
//     }
//   }
// }

// void checkTelegram() {
//   if (WiFi.status() != WL_CONNECTED) return;
//   if (millis() - lastTelegramCheck < 2000) return;

//   lastTelegramCheck = millis();

//   int numNewMessages = bot.getUpdates(bot.last_message_received + 1);

//   while (numNewMessages) {
//     handleNewMessages(numNewMessages);
//     numNewMessages = bot.getUpdates(bot.last_message_received + 1);
//   }
// }

// // ===================== TASKS =====================
// void taskReadData() {
//   readSensors();
//   printSerialData();
// }

// void taskDisplayUpdate() {
//   updateOLED();
// }

// void taskCloudUpdate() {
//   updateBlynk();
// }

// void taskTelegramNotify() {
//   notifyWeatherChange();
//   notifyGasLevel();
// }

// // ===================== WIFI =====================
// void connectWiFi() {
//   WiFi.mode(WIFI_STA);
//   WiFi.begin(ssid, pass);

//   Serial.print("Dang ket noi WiFi");
//   unsigned long startAttemptTime = millis();

//   while (WiFi.status() != WL_CONNECTED && millis() - startAttemptTime < 20000) {
//     delay(500);
//     Serial.print(".");
//   }
//   Serial.println();

//   if (WiFi.status() == WL_CONNECTED) {
//     Serial.print("WiFi OK. IP: ");
//     Serial.println(WiFi.localIP());
//   } else {
//     Serial.println("Khong ket noi duoc WiFi.");
//   }
// }

// void reconnectIfNeeded() {
//   static unsigned long lastReconnectAttempt = 0;
//   if (millis() - lastReconnectAttempt < 5000) return;
//   lastReconnectAttempt = millis();

//   if (WiFi.status() != WL_CONNECTED) {
//     connectWiFi();
//   }

//   if (WiFi.status() == WL_CONNECTED && !Blynk.connected()) {
//     Serial.println("Dang ket noi lai Blynk...");
//     Blynk.connect(5000);
//   }
// }

// // ===================== SETUP =====================
// void setup() {
//   Serial.begin(115200);
//   delay(200);

//   pinMode(RELAY_PIN, OUTPUT);
//   digitalWrite(RELAY_PIN, HIGH);

//   dht.begin();

//   Wire.begin(OLED_SDA, OLED_SCL);
//   if (!display.begin(0x3C, true)) {
//     Serial.println("Khong tim thay OLED SH1106!");
//     while (true) {
//       delay(1000);
//     }
//   }

//   display.clearDisplay();
//   display.setTextSize(1);
//   display.setTextColor(SH110X_WHITE);
//   display.setCursor(0, 0);
//   display.println("Dang khoi dong...");
//   display.display();

//   randomSeed(analogRead(A0));

//   connectWiFi();

//   Blynk.config(BLYNK_AUTH_TOKEN);
//   if (WiFi.status() == WL_CONNECTED) {
//     Blynk.connect(10000);
//   }

//   secured_client.setInsecure();

//   setRelay(false);
//   readSensors();
//   updateOLED();
//   updateBlynk();

//   timer.setInterval(2500L, taskReadData);       // doc cam bien
//   timer.setInterval(200L, taskDisplayUpdate);   // OLED cap nhat lien tuc
//   timer.setInterval(3000L, taskCloudUpdate);
//   timer.setInterval(5000L, taskTelegramNotify);

//   Serial.println("He thong san sang.");

//   if (WiFi.status() == WL_CONNECTED) {
//     String msg = "✨ *ESP8266 DA KHOI DONG!* ✨\n";
//     msg += "━━━━━━━━━━━━━━\n";
//     msg += "📡 IP: `" + WiFi.localIP().toString() + "`\n";
//     msg += "📶 WiFi: `" + String(ssid) + "`\n";
//     msg += "🌡️ Temp: `" + String(temperature, 1) + " C`\n";
//     msg += "💡 Relay: `" + String(relayState ? "BAT" : "TAT") + "`\n";
//     msg += "━━━━━━━━━━━━━━\n";
//     msg += "🤖 San sang nhan lenh!\n";
//     msg += "👥 " + String(TEAM_NAME);

//     sendTelegramMessage(msg);
//   }
// }

// // ===================== LOOP =====================
// void loop() {
//   reconnectIfNeeded();
//   Blynk.run();
//   timer.run();
//   checkTelegram();
// }